#include <stdlib.h>
#include <time.h>
int get_Fibbo(int *a);	//* функція для заповнення масиву числами Фібоначчі

int main(){	// * створюємо функцію
int array[20]; 	// * створюємо масив з 20 елементів
get_Fibbo(array);
}

int get_Fibbo(int *a){
a[0] = 0; 	// * оголошуємо початкове значення нульового елемента масиву
a[1] = 1; 	// * оголошуємо початкове значення першого елемента масиву
for (int i = 2; i < 20; i++) {	// * створюємо цикл для заповнення масиву цілими числами Фібоначчі
a[i] = a[i - 1]+ a[i - 2]; 	// * записуємо формулу для обчислення чисел Фібоначчі
} 	// * кінець циклу
return *a; 	// * повертаємо результат програми
} 	// * кінець функції
