/**
 * @Author: valadon
 * @Date:   2020-12-21T00:24:22+02:00
 * @Last modified by:   valadon
 * @Last modified time: 2020-12-21T02:12:08+02:00
 */



#pragma once
#include <stdlib.h>	//*підключення бібліотеки stdlib.h для виділення пам'яті та контролем за процесом роботи програми
#include <time.h>	//*підключення бібліотеки time.h, зберігаючий типи та функції для роботи з датою і часом

#define N 7	//*глобальна змінна , відповідає за кількість розмірністі двомірного масиву

void fillMass(int *mass);	//* функція для заповнення динамічного двомірного масиву
void fillGenDiag(int *mass, int *a);	//* функція для знаходження головної діагоналі динамічного двомірного масиву та створення для нього  динамічного одномірного масиву
void ReplaceMass(int *a);	//* функція для сортування динамічного одномірного масиву за зростанням
