#define N 238571

int main(){
//* FOR
	
	int r_f = 0;	//* змінна оберненого числа у циклі for
	for(int n_f = N; n_f != 0;){
	r_f *= 10;
	r_f += (n_f % 10);
	n_f /= 10;
	}
	
	
//* WHILE
	int r_w = 0;	//* змінна оберненого числа у циклі while
	int n_w = N;	//* змінна початкового числа для перестановки числа
	while(n_w != 0 ){
	r_w *= 10;
	r_w += (n_w % 10);
	n_w /= 10;
	}
	
	
//* DO
	int r_d = 0;	//* змінна оберненого числа у циклі do
	int n_d = N;	//* змінна початкового числа для перестановки числа
	do{
	r_d *= 10;
	r_d += (n_d % 10);
	n_d /= 10;
	
	}while( n_d != 0 );
	
	
	return 0;
	}

