int main () {	// * створюємо функцію
int a [20]; 	// * створюємо масив з 20 елементів
a [0] = 0; 	// * оголошуємо початкове значення нульового елемента масиву
a [1] = 1; 	// * оголошуємо початкове значення першого елемента масиву
for (int i = 2; i <20; i++) {	// * створюємо цикл для заповнення масиву цілими числами Фіббоначі
a[i] = a [i - 1] + a [i - 2]; 	// * записуємо формулу для обчислення чисел Фіббоначі
} 	// * кінець циклу
return 0; 	// * Закінчуємо поточну функцію main () і повертаємо результат програми
} 	// * кінець функції
