int main(){	//* створюємо int main()
int N = 7;
	//* FOR
int fact_F = 1;	//* создаем переменную двойного факториала для цикла for
for ( int i = 1; i <= N;){	//* создаем цикл for
	fact_F *= i;	//* формула для обчислення подвійного факторіала
	i = i + 2;
	}	//* конец цикла for
	
	//* WHILE
int fact_W = 1;	//* создаем переменную двойного факториала для цикла while
while(int i <= N){	//* создаем цикл while
	fact_W *= i; 	//* формула для обчислення подвійного факторіала
	i = i + 2;
}	//* конец цикла while

	//* DO_WHILE
int fact_D;
do{	//* do_while
	fact_D *= i;	//* формула для обчислення подвійного факторіала 
	i = i + 2;
	}while(int i <= N);
}	//* кінець int main()
